{"config": [{"config": {"name": "batchnormalization_1", "momentum": 0.99, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "mode": 0, "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "gamma_regularizer": null, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"dim_ordering": "tf", "b_regularizer": null, "trainable": true, "subsample": [2, 2], "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "nb_row": 11, "border_mode": "valid", "bias": true, "nb_col": 11, "activation": "linear", "init": "glorot_uniform", "nb_filter": 40, "name": "convolution2d_1", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"dim_ordering": "tf", "b_regularizer": null, "trainable": true, "subsample": [2, 2], "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "nb_row": 7, "border_mode": "valid", "bias": true, "nb_col": 7, "activation": "linear", "init": "glorot_uniform", "nb_filter": 60, "name": "convolution2d_2", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"dim_ordering": "tf", "b_regularizer": null, "trainable": true, "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "nb_row": 3, "border_mode": "valid", "bias": true, "nb_col": 3, "activation": "linear", "init": "glorot_uniform", "nb_filter": 80, "name": "convolution2d_3", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "b_regularizer": null, "trainable": true, "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "nb_row": 3, "border_mode": "valid", "bias": true, "nb_col": 1, "activation": "linear", "init": "glorot_uniform", "nb_filter": 110, "name": "convolution2d_4", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "input_dim": 7040, "bias": true, "output_dim": 1000, "activation": "linear", "init": "glorot_uniform", "name": "dense_1", "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "input_dim": 1000, "bias": true, "output_dim": 200, "activation": "linear", "init": "glorot_uniform", "name": "dense_2", "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "input_dim": 200, "bias": true, "output_dim": 50, "activation": "linear", "init": "glorot_uniform", "name": "dense_3", "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "input_dim": 50, "bias": true, "output_dim": 10, "activation": "linear", "init": "glorot_uniform", "name": "dense_4", "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "input_dim": 10, "bias": true, "output_dim": 1, "activation": "linear", "init": "glorot_uniform", "name": "dense_5", "W_constraint": null}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}