{"class_name": "Model", "keras_version": "1.2.1", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "sparse": false}, "inbound_nodes": []}, {"name": "convolution2d_1", "class_name": "Convolution2D", "config": {"border_mode": "valid", "dim_ordering": "tf", "nb_row": 3, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 32, "W_regularizer": null, "name": "convolution2d_1", "W_constraint": null, "subsample": [2, 2], "b_constraint": null, "bias": true, "nb_col": 3, "activity_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "batchnormalization_1", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_1", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"name": "convolution2d_2", "class_name": "Convolution2D", "config": {"border_mode": "valid", "dim_ordering": "tf", "nb_row": 3, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 32, "W_regularizer": null, "name": "convolution2d_2", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 3, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"name": "batchnormalization_2", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_2", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"name": "convolution2d_3", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 3, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "name": "convolution2d_3", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 3, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]]}, {"name": "batchnormalization_3", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_3", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"name": "maxpooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "pool_size": [3, 3], "trainable": false, "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]]}, {"name": "convolution2d_4", "class_name": "Convolution2D", "config": {"border_mode": "valid", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 80, "W_regularizer": null, "name": "convolution2d_4", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"name": "batchnormalization_4", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_4", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"name": "convolution2d_5", "class_name": "Convolution2D", "config": {"border_mode": "valid", "dim_ordering": "tf", "nb_row": 3, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "name": "convolution2d_5", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 3, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_4", 0, 0]]]}, {"name": "batchnormalization_5", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_5", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"name": "maxpooling2d_2", "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "pool_size": [3, 3], "trainable": false, "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["batchnormalization_5", 0, 0]]]}, {"name": "convolution2d_9", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "name": "convolution2d_9", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"name": "batchnormalization_9", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_9", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_9", 0, 0]]]}, {"name": "convolution2d_7", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 48, "W_regularizer": null, "name": "convolution2d_7", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"name": "convolution2d_10", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 3, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 96, "W_regularizer": null, "name": "convolution2d_10", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 3, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_9", 0, 0]]]}, {"name": "batchnormalization_7", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_7", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"name": "batchnormalization_10", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_10", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"name": "averagepooling2d_1", "class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_1", "pool_size": [3, 3], "trainable": false, "dim_ordering": "tf", "strides": [1, 1], "border_mode": "same"}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"name": "convolution2d_6", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "name": "convolution2d_6", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"name": "convolution2d_8", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 5, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "name": "convolution2d_8", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 5, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_7", 0, 0]]]}, {"name": "convolution2d_11", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 3, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 96, "W_regularizer": null, "name": "convolution2d_11", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 3, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_10", 0, 0]]]}, {"name": "convolution2d_12", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 32, "W_regularizer": null, "name": "convolution2d_12", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["averagepooling2d_1", 0, 0]]]}, {"name": "batchnormalization_6", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_6", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"name": "batchnormalization_8", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_8", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"name": "batchnormalization_11", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_11", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_11", 0, 0]]]}, {"name": "batchnormalization_12", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_12", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_12", 0, 0]]]}, {"name": "mixed0", "class_name": "Merge", "config": {"name": "mixed0", "mode_type": "raw", "mode": "concat", "output_mask_type": "raw", "output_mask": null, "arguments": {}, "output_shape_type": "raw", "dot_axes": -1, "concat_axis": 3, "output_shape": null}, "inbound_nodes": [[["batchnormalization_6", 0, 0], ["batchnormalization_8", 0, 0], ["batchnormalization_11", 0, 0], ["batchnormalization_12", 0, 0]]]}, {"name": "convolution2d_16", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "name": "convolution2d_16", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["mixed0", 0, 0]]]}, {"name": "batchnormalization_16", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_16", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_16", 0, 0]]]}, {"name": "convolution2d_14", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 48, "W_regularizer": null, "name": "convolution2d_14", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["mixed0", 0, 0]]]}, {"name": "convolution2d_17", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 3, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 96, "W_regularizer": null, "name": "convolution2d_17", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 3, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_16", 0, 0]]]}, {"name": "batchnormalization_14", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_14", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_14", 0, 0]]]}, {"name": "batchnormalization_17", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_17", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_17", 0, 0]]]}, {"name": "averagepooling2d_2", "class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_2", "pool_size": [3, 3], "trainable": false, "dim_ordering": "tf", "strides": [1, 1], "border_mode": "same"}, "inbound_nodes": [[["mixed0", 0, 0]]]}, {"name": "convolution2d_13", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "name": "convolution2d_13", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["mixed0", 0, 0]]]}, {"name": "convolution2d_15", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 5, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "name": "convolution2d_15", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 5, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_14", 0, 0]]]}, {"name": "convolution2d_18", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 3, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 96, "W_regularizer": null, "name": "convolution2d_18", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 3, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_17", 0, 0]]]}, {"name": "convolution2d_19", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 32, "W_regularizer": null, "name": "convolution2d_19", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["averagepooling2d_2", 0, 0]]]}, {"name": "batchnormalization_13", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_13", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_13", 0, 0]]]}, {"name": "batchnormalization_15", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_15", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_15", 0, 0]]]}, {"name": "batchnormalization_18", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_18", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_18", 0, 0]]]}, {"name": "batchnormalization_19", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_19", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_19", 0, 0]]]}, {"name": "mixed1", "class_name": "Merge", "config": {"name": "mixed1", "mode_type": "raw", "mode": "concat", "output_mask_type": "raw", "output_mask": null, "arguments": {}, "output_shape_type": "raw", "dot_axes": -1, "concat_axis": 3, "output_shape": null}, "inbound_nodes": [[["batchnormalization_13", 0, 0], ["batchnormalization_15", 0, 0], ["batchnormalization_18", 0, 0], ["batchnormalization_19", 0, 0]]]}, {"name": "convolution2d_23", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "name": "convolution2d_23", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["mixed1", 0, 0]]]}, {"name": "batchnormalization_23", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_23", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_23", 0, 0]]]}, {"name": "convolution2d_21", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 48, "W_regularizer": null, "name": "convolution2d_21", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["mixed1", 0, 0]]]}, {"name": "convolution2d_24", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 3, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 96, "W_regularizer": null, "name": "convolution2d_24", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 3, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_23", 0, 0]]]}, {"name": "batchnormalization_21", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_21", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_21", 0, 0]]]}, {"name": "batchnormalization_24", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_24", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_24", 0, 0]]]}, {"name": "averagepooling2d_3", "class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_3", "pool_size": [3, 3], "trainable": false, "dim_ordering": "tf", "strides": [1, 1], "border_mode": "same"}, "inbound_nodes": [[["mixed1", 0, 0]]]}, {"name": "convolution2d_20", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "name": "convolution2d_20", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["mixed1", 0, 0]]]}, {"name": "convolution2d_22", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 5, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "name": "convolution2d_22", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 5, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_21", 0, 0]]]}, {"name": "convolution2d_25", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 3, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 96, "W_regularizer": null, "name": "convolution2d_25", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 3, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_24", 0, 0]]]}, {"name": "convolution2d_26", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 32, "W_regularizer": null, "name": "convolution2d_26", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["averagepooling2d_3", 0, 0]]]}, {"name": "batchnormalization_20", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_20", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_20", 0, 0]]]}, {"name": "batchnormalization_22", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_22", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_22", 0, 0]]]}, {"name": "batchnormalization_25", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_25", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_25", 0, 0]]]}, {"name": "batchnormalization_26", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_26", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_26", 0, 0]]]}, {"name": "mixed2", "class_name": "Merge", "config": {"name": "mixed2", "mode_type": "raw", "mode": "concat", "output_mask_type": "raw", "output_mask": null, "arguments": {}, "output_shape_type": "raw", "dot_axes": -1, "concat_axis": 3, "output_shape": null}, "inbound_nodes": [[["batchnormalization_20", 0, 0], ["batchnormalization_22", 0, 0], ["batchnormalization_25", 0, 0], ["batchnormalization_26", 0, 0]]]}, {"name": "convolution2d_28", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "name": "convolution2d_28", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["mixed2", 0, 0]]]}, {"name": "batchnormalization_28", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_28", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_28", 0, 0]]]}, {"name": "convolution2d_29", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 3, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 96, "W_regularizer": null, "name": "convolution2d_29", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 3, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_28", 0, 0]]]}, {"name": "batchnormalization_29", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_29", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_29", 0, 0]]]}, {"name": "convolution2d_27", "class_name": "Convolution2D", "config": {"border_mode": "valid", "dim_ordering": "tf", "nb_row": 3, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 384, "W_regularizer": null, "name": "convolution2d_27", "W_constraint": null, "subsample": [2, 2], "b_constraint": null, "bias": true, "nb_col": 3, "activity_regularizer": null}, "inbound_nodes": [[["mixed2", 0, 0]]]}, {"name": "convolution2d_30", "class_name": "Convolution2D", "config": {"border_mode": "valid", "dim_ordering": "tf", "nb_row": 3, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 96, "W_regularizer": null, "name": "convolution2d_30", "W_constraint": null, "subsample": [2, 2], "b_constraint": null, "bias": true, "nb_col": 3, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_29", 0, 0]]]}, {"name": "batchnormalization_27", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_27", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_27", 0, 0]]]}, {"name": "batchnormalization_30", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_30", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_30", 0, 0]]]}, {"name": "maxpooling2d_3", "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "pool_size": [3, 3], "trainable": false, "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["mixed2", 0, 0]]]}, {"name": "mixed3", "class_name": "Merge", "config": {"name": "mixed3", "mode_type": "raw", "mode": "concat", "output_mask_type": "raw", "output_mask": null, "arguments": {}, "output_shape_type": "raw", "dot_axes": -1, "concat_axis": 3, "output_shape": null}, "inbound_nodes": [[["batchnormalization_27", 0, 0], ["batchnormalization_30", 0, 0], ["maxpooling2d_3", 0, 0]]]}, {"name": "convolution2d_35", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 128, "W_regularizer": null, "name": "convolution2d_35", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["mixed3", 0, 0]]]}, {"name": "batchnormalization_35", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_35", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_35", 0, 0]]]}, {"name": "convolution2d_36", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 7, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 128, "W_regularizer": null, "name": "convolution2d_36", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_35", 0, 0]]]}, {"name": "batchnormalization_36", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_36", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_36", 0, 0]]]}, {"name": "convolution2d_32", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 128, "W_regularizer": null, "name": "convolution2d_32", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["mixed3", 0, 0]]]}, {"name": "convolution2d_37", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 128, "W_regularizer": null, "name": "convolution2d_37", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 7, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_36", 0, 0]]]}, {"name": "batchnormalization_32", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_32", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_32", 0, 0]]]}, {"name": "batchnormalization_37", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_37", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_37", 0, 0]]]}, {"name": "convolution2d_33", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 128, "W_regularizer": null, "name": "convolution2d_33", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 7, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_32", 0, 0]]]}, {"name": "convolution2d_38", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 7, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 128, "W_regularizer": null, "name": "convolution2d_38", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_37", 0, 0]]]}, {"name": "batchnormalization_33", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_33", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_33", 0, 0]]]}, {"name": "batchnormalization_38", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_38", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_38", 0, 0]]]}, {"name": "averagepooling2d_4", "class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_4", "pool_size": [3, 3], "trainable": false, "dim_ordering": "tf", "strides": [1, 1], "border_mode": "same"}, "inbound_nodes": [[["mixed3", 0, 0]]]}, {"name": "convolution2d_31", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "name": "convolution2d_31", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["mixed3", 0, 0]]]}, {"name": "convolution2d_34", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 7, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "name": "convolution2d_34", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_33", 0, 0]]]}, {"name": "convolution2d_39", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "name": "convolution2d_39", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 7, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_38", 0, 0]]]}, {"name": "convolution2d_40", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "name": "convolution2d_40", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["averagepooling2d_4", 0, 0]]]}, {"name": "batchnormalization_31", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_31", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_31", 0, 0]]]}, {"name": "batchnormalization_34", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_34", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_34", 0, 0]]]}, {"name": "batchnormalization_39", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_39", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_39", 0, 0]]]}, {"name": "batchnormalization_40", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_40", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_40", 0, 0]]]}, {"name": "mixed4", "class_name": "Merge", "config": {"name": "mixed4", "mode_type": "raw", "mode": "concat", "output_mask_type": "raw", "output_mask": null, "arguments": {}, "output_shape_type": "raw", "dot_axes": -1, "concat_axis": 3, "output_shape": null}, "inbound_nodes": [[["batchnormalization_31", 0, 0], ["batchnormalization_34", 0, 0], ["batchnormalization_39", 0, 0], ["batchnormalization_40", 0, 0]]]}, {"name": "convolution2d_45", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 160, "W_regularizer": null, "name": "convolution2d_45", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["mixed4", 0, 0]]]}, {"name": "batchnormalization_45", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_45", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_45", 0, 0]]]}, {"name": "convolution2d_46", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 7, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 160, "W_regularizer": null, "name": "convolution2d_46", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_45", 0, 0]]]}, {"name": "batchnormalization_46", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_46", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_46", 0, 0]]]}, {"name": "convolution2d_42", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 160, "W_regularizer": null, "name": "convolution2d_42", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["mixed4", 0, 0]]]}, {"name": "convolution2d_47", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 160, "W_regularizer": null, "name": "convolution2d_47", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 7, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_46", 0, 0]]]}, {"name": "batchnormalization_42", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_42", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_42", 0, 0]]]}, {"name": "batchnormalization_47", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_47", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_47", 0, 0]]]}, {"name": "convolution2d_43", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 160, "W_regularizer": null, "name": "convolution2d_43", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 7, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_42", 0, 0]]]}, {"name": "convolution2d_48", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 7, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 160, "W_regularizer": null, "name": "convolution2d_48", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_47", 0, 0]]]}, {"name": "batchnormalization_43", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_43", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_43", 0, 0]]]}, {"name": "batchnormalization_48", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_48", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_48", 0, 0]]]}, {"name": "averagepooling2d_5", "class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_5", "pool_size": [3, 3], "trainable": false, "dim_ordering": "tf", "strides": [1, 1], "border_mode": "same"}, "inbound_nodes": [[["mixed4", 0, 0]]]}, {"name": "convolution2d_41", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "name": "convolution2d_41", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["mixed4", 0, 0]]]}, {"name": "convolution2d_44", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 7, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "name": "convolution2d_44", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_43", 0, 0]]]}, {"name": "convolution2d_49", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "name": "convolution2d_49", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 7, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_48", 0, 0]]]}, {"name": "convolution2d_50", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "name": "convolution2d_50", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["averagepooling2d_5", 0, 0]]]}, {"name": "batchnormalization_41", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_41", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_41", 0, 0]]]}, {"name": "batchnormalization_44", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_44", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_44", 0, 0]]]}, {"name": "batchnormalization_49", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_49", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_49", 0, 0]]]}, {"name": "batchnormalization_50", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_50", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_50", 0, 0]]]}, {"name": "mixed5", "class_name": "Merge", "config": {"name": "mixed5", "mode_type": "raw", "mode": "concat", "output_mask_type": "raw", "output_mask": null, "arguments": {}, "output_shape_type": "raw", "dot_axes": -1, "concat_axis": 3, "output_shape": null}, "inbound_nodes": [[["batchnormalization_41", 0, 0], ["batchnormalization_44", 0, 0], ["batchnormalization_49", 0, 0], ["batchnormalization_50", 0, 0]]]}, {"name": "convolution2d_55", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 160, "W_regularizer": null, "name": "convolution2d_55", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["mixed5", 0, 0]]]}, {"name": "batchnormalization_55", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_55", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_55", 0, 0]]]}, {"name": "convolution2d_56", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 7, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 160, "W_regularizer": null, "name": "convolution2d_56", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_55", 0, 0]]]}, {"name": "batchnormalization_56", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_56", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_56", 0, 0]]]}, {"name": "convolution2d_52", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 160, "W_regularizer": null, "name": "convolution2d_52", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["mixed5", 0, 0]]]}, {"name": "convolution2d_57", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 160, "W_regularizer": null, "name": "convolution2d_57", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 7, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_56", 0, 0]]]}, {"name": "batchnormalization_52", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_52", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_52", 0, 0]]]}, {"name": "batchnormalization_57", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_57", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_57", 0, 0]]]}, {"name": "convolution2d_53", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 160, "W_regularizer": null, "name": "convolution2d_53", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 7, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_52", 0, 0]]]}, {"name": "convolution2d_58", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 7, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 160, "W_regularizer": null, "name": "convolution2d_58", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_57", 0, 0]]]}, {"name": "batchnormalization_53", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_53", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_53", 0, 0]]]}, {"name": "batchnormalization_58", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_58", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_58", 0, 0]]]}, {"name": "averagepooling2d_6", "class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_6", "pool_size": [3, 3], "trainable": false, "dim_ordering": "tf", "strides": [1, 1], "border_mode": "same"}, "inbound_nodes": [[["mixed5", 0, 0]]]}, {"name": "convolution2d_51", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "name": "convolution2d_51", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["mixed5", 0, 0]]]}, {"name": "convolution2d_54", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 7, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "name": "convolution2d_54", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_53", 0, 0]]]}, {"name": "convolution2d_59", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "name": "convolution2d_59", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 7, "activity_regularizer": null}, "inbound_nodes": [[["batchnormalization_58", 0, 0]]]}, {"name": "convolution2d_60", "class_name": "Convolution2D", "config": {"border_mode": "same", "dim_ordering": "tf", "nb_row": 1, "trainable": false, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 192, "W_regularizer": null, "name": "convolution2d_60", "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "nb_col": 1, "activity_regularizer": null}, "inbound_nodes": [[["averagepooling2d_6", 0, 0]]]}, {"name": "batchnormalization_51", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_51", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_51", 0, 0]]]}, {"name": "batchnormalization_54", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_54", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": null, "gamma_regularizer": null}, "inbound_nodes": [[["convolution2d_54", 0, 0]]]}, {"name": "batchnormalization_59", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_59", "epsilon": 0.001, "mode": 0, "momentum": 0.99, "axis": 3, "trainable": false, "beta_regularizer": 