{"keras_version": "1.2.1", "config": [{"class_name": "BatchNormalization", "config": {"mode": 0, "epsilon": 0.001, "beta_regularizer": null, "name": "batchnormalization_1", "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "gamma_regularizer": null, "momentum": 0.99, "axis": -1, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 11, "b_constraint": null, "W_constraint": null, "name": "convolution2d_1", "bias": true, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "trainable": true, "subsample": [2, 2], "W_regularizer": null, "nb_filter": 40, "nb_col": 11, "init": "glorot_uniform", "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"nb_row": 7, "b_constraint": null, "W_constraint": null, "name": "convolution2d_2", "bias": true, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "trainable": true, "subsample": [2, 2], "W_regularizer": null, "nb_filter": 60, "nb_col": 7, "init": "glorot_uniform", "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "b_constraint": null, "W_constraint": null, "name": "convolution2d_3", "bias": true, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "trainable": true, "subsample": [2, 2], "W_regularizer": null, "nb_filter": 80, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "b_constraint": null, "W_constraint": null, "name": "convolution2d_4", "bias": true, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "trainable": true, "subsample": [1, 1], "W_regularizer": null, "nb_filter": 110, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_constraint": null, "name": "dense_1", "output_dim": 240, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "bias": true, "trainable": true, "input_dim": 660, "W_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_constraint": null, "name": "dense_2", "output_dim": 120, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "bias": true, "trainable": true, "input_dim": 240, "W_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_constraint": null, "name": "dense_3", "output_dim": 50, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "bias": true, "trainable": true, "input_dim": 120, "W_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_constraint": null, "name": "dense_4", "output_dim": 10, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "bias": true, "trainable": true, "input_dim": 50, "W_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_constraint": null, "name": "dense_5", "output_dim": 1, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "bias": true, "trainable": true, "input_dim": 10, "W_regularizer": null, "b_constraint": null}}], "class_name": "Sequential"}